#Demonstração Pandas
###Disciplina - Introdução a Ciência de Dados - Univesp

###Prof. Dr. José Eduardo Santarem

#Importando Biblioteca

In [60]:
import pandas as pd
import numpy as ny

#Series

Objeto do tipo array unidimensional;

* Sequência de valores e um array associado de rótulos 
(labels) de dados chamado de índice.

* A representação em string de uma Series mostra índices à 
esquerda e valores à direita (vamos ver na demonstração).

* Diferente do NumPy, nas Series podemos ter rótulos nos 
índices.

In [2]:
data = pd.Series([1,2,3,4,5])
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
data.values

array([1, 2, 3, 4, 5])

In [4]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
data_news = pd.Series([1,2,3,4,5], index = ['a', 'b', 'c', 'd', 'e'])
data_news

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
data_news.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
#Atribuição via Indice;

data_news['a'] = 1000
data_news

a    1000
b       2
c       3
d       4
e       5
dtype: int64

#Comparação

In [8]:
data_news[data_news > 0]

a    1000
b       2
c       3
d       4
e       5
dtype: int64

#Álgebra

In [9]:
data_news * 100

a    100000
b       200
c       300
d       400
e       500
dtype: int64

In [10]:
data_news - 100

a    900
b    -98
c    -97
d    -96
e    -95
dtype: int64

**Verificando se existe valores Nulos na Serie;**

In [11]:
data_news.isnull()

a    False
b    False
c    False
d    False
e    False
dtype: bool

#DataFrame

Representa uma tabela de dados retangular e contém uma 
coleção ordenada de colunas, em que cada uma pode ter 
um tipo de valor diferente (booleano, string, numérico, entre 
outros).

* O Dataframe tem índice tanto para linha quanto para coluna, 
podendo ser imaginado como um dicionário (dict) de Series, 
todos compartilhando o mesmo índice.

* A capacidade de trabalhar com vários tipos de dados, como 
se fosse uma tabela de banco de dados, favorece 
consideravelmente o trabalho de um profissional de Data Science.

In [12]:
#Criando um DataFrame;


dados={'estado':['SP', 'MG','PR','SP','MG','PR'], 'ano':[2019, 2019,2019, 2020,2020,2020], 'pop':[45.9, 21.2,16.9,46.6,21.4,17.3]}
frame=pd.DataFrame(dados)

In [13]:
frame #Visualizando;

  estado   ano   pop
0     SP  2019  45.9
1     MG  2019  21.2
2     PR  2019  16.9
3     SP  2020  46.6
4     MG  2020  21.4
5     PR  2020  17.3

In [14]:
frame.head(2) #Visualizando os primeiros dois registros do DataFrame;

  estado   ano   pop
0     SP  2019  45.9
1     MG  2019  21.2

In [15]:
#Visualizando os últimos dados do DataFrame;
frame.tail(2)

  estado   ano   pop
4     MG  2020  21.4
5     PR  2020  17.3

In [16]:
#Visualizando dados aleatórios do DataFrame;

frame.sample(2)

  estado   ano   pop
3     SP  2020  46.6
2     PR  2019  16.9

**Gerando um DataFrame a partir de um já existente;**

In [17]:
new_frame = pd.DataFrame(dados, columns=['ano', 'estado', 'pop'])
new_frame

    ano estado   pop
0  2019     SP  45.9
1  2019     MG  21.2
2  2019     PR  16.9
3  2020     SP  46.6
4  2020     MG  21.4
5  2020     PR  17.3

**Observando o DataFrame**

In [18]:
new_frame['estado']

0    SP
1    MG
2    PR
3    SP
4    MG
5    PR
Name: estado, dtype: object

In [20]:
new_frame.ano

0    2019
1    2019
2    2019
3    2020
4    2020
5    2020
Name: ano, dtype: int64

**Atribuindo Valores**

In [28]:
new_frame['estimativa'] = 50

In [27]:
new_frame

    ano estado   pop  estimativa
0  2019     SP  45.9          50
1  2019     MG  21.2          50
2  2019     PR  16.9          50
3  2020     SP  46.6          50
4  2020     MG  21.4          50
5  2020     PR  17.3          50

In [30]:
import numpy as np
new_frame['estimativa']=np.arange(6)

In [31]:
new_frame

    ano estado   pop  estimativa
0  2019     SP  45.9           0
1  2019     MG  21.2           1
2  2019     PR  16.9           2
3  2020     SP  46.6           3
4  2020     MG  21.4           4
5  2020     PR  17.3           5

In [33]:
#Recortando um DataFrame 


novo_frame = new_frame['ano']

In [34]:
novo_frame

0    2019
1    2019
2    2019
3    2020
4    2020
5    2020
Name: ano, dtype: int64

In [35]:
new_frame['Não é São Paulo'] = new_frame.estado!='SP'

In [36]:
new_frame

    ano estado   pop  estimativa  Não é São Paulo
0  2019     SP  45.9           0            False
1  2019     MG  21.2           1             True
2  2019     PR  16.9           2             True
3  2020     SP  46.6           3            False
4  2020     MG  21.4           4             True
5  2020     PR  17.3           5             True

In [37]:
#Excluindo Colunas do DataFrame;

del new_frame['Não é São Paulo']

In [38]:
new_frame

    ano estado   pop  estimativa
0  2019     SP  45.9           0
1  2019     MG  21.2           1
2  2019     PR  16.9           2
3  2020     SP  46.6           3
4  2020     MG  21.4           4
5  2020     PR  17.3           5

#Entendendo o DataFrame

In [ ]:
#Verificando o tamanho do DataFrame;

In [40]:
new_frame.shape

(6, 4)

In [42]:
new_frame.shape[0]

6

In [43]:
new_frame.index

RangeIndex(start=0, stop=6, step=1)

In [44]:
new_frame.columns

Index(['ano', 'estado', 'pop', 'estimativa'], dtype='object')

In [46]:
#Fazendo a contagem de registros;

new_frame.count()

ano           6
estado        6
pop           6
estimativa    6
dtype: int64

**Alterando Infomações da Coluna**

In [48]:
new_frame = ['Ano', 'Estado', 'População', 'Estimativa']

In [55]:
new_frame

['Ano', 'Estado', 'População', 'Estimativa']

**Analisando o DataFrame**

In [63]:
frame.describe(include='all')

       estado          ano        pop
count       6     6.000000   6.000000
unique      3          NaN        NaN
top        SP          NaN        NaN
freq        2          NaN        NaN
mean      NaN  2019.500000  28.216667
std       NaN     0.547723  14.096725
min       NaN  2019.000000  16.900000
25%       NaN  2019.000000  18.275000
50%       NaN  2019.500000  21.300000
75%       NaN  2020.000000  39.775000
max       NaN  2020.000000  46.600000

**Alteração de Valores e Consulta**

In [66]:
frame['ano'] = frame['ano'] + 2

In [67]:
frame

  estado   ano   pop
0     SP  2021  45.9
1     MG  2021  21.2
2     PR  2021  16.9
3     SP  2022  46.6
4     MG  2022  21.4
5     PR  2022  17.3

In [68]:
#Atribuição de valores via Comparação;
frame[frame['ano']>2021]

  estado   ano   pop
3     SP  2022  46.6
4     MG  2022  21.4
5     PR  2022  17.3

In [71]:
new = frame[frame['ano']>2021]
new

  estado   ano   pop
3     SP  2022  46.6
4     MG  2022  21.4
5     PR  2022  17.3

**Excluindo Colunas**

In [72]:
frame.drop('ano', axis = 'columns')

  estado   pop
0     SP  45.9
1     MG  21.2
2     PR  16.9
3     SP  46.6
4     MG  21.4
5     PR  17.3

In [73]:
frame

  estado   ano   pop
0     SP  2021  45.9
1     MG  2021  21.2
2     PR  2021  16.9
3     SP  2022  46.6
4     MG  2022  21.4
5     PR  2022  17.3

In [ ]:
# frame.drop('ano', axis = 'columns', inplace=True) #O método inplace realmente deleta a coluna do DataFrame

**Deletando Linhas**

In [74]:
frame.drop([0, 1])

  estado   ano   pop
2     PR  2021  16.9
3     SP  2022  46.6
4     MG  2022  21.4
5     PR  2022  17.3

In [75]:
frame

  estado   ano   pop
0     SP  2021  45.9
1     MG  2021  21.2
2     PR  2021  16.9
3     SP  2022  46.6
4     MG  2022  21.4
5     PR  2022  17.3

In [81]:
dflinhas = frame

In [ ]:
dflinhas.drop([0,1], inplace=True)

In [83]:
dflinhas

  estado   ano   pop
2     PR  2021  16.9
3     SP  2022  46.6
4     MG  2022  21.4
5     PR  2022  17.3

In [84]:
frame

  estado   ano   pop
2     PR  2021  16.9
3     SP  2022  46.6
4     MG  2022  21.4
5     PR  2022  17.3

**Dados em Linha**

In [85]:
frame.iloc[0]

estado      PR
ano       2021
pop       16.9
Name: 2, dtype: object

In [86]:
frame.iloc[1:3]

  estado   ano   pop
3     SP  2022  46.6
4     MG  2022  21.4

In [87]:
#Especificando vinha linhas e colunas

frame.iloc[1:3,[1,2]]

    ano   pop
3  2022  46.6
4  2022  21.4

In [88]:
frame

  estado   ano   pop
2     PR  2021  16.9
3     SP  2022  46.6
4     MG  2022  21.4
5     PR  2022  17.3